In [1]:
import numpy as np
import pandas as pd

In [3]:
from ucimlrepo import fetch_ucirepo 
  
# fetch dataset 
online_retail = fetch_ucirepo(id=352) 
  
# data (as pandas dataframes) 
X = online_retail.data.features 
y = online_retail.data.targets 
  
# metadata 
# print(online_retail.metadata) 
  
# variable information 
# print(online_retail.variables)

In [10]:
X.head()

,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
2,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom
3,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
4,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom

In [9]:
X.columns

Index(['Description', 'Quantity', 'InvoiceDate', 'UnitPrice', 'CustomerID',
       'Country'],
      dtype='object')

In [11]:
X.describe()

            Quantity      UnitPrice     CustomerID
count  541909.000000  541909.000000  406829.000000
mean        9.552250       4.611114   15287.690570
std       218.081158      96.759853    1713.600303
min    -80995.000000  -11062.060000   12346.000000
25%         1.000000       1.250000   13953.000000
50%         3.000000       2.080000   15152.000000
75%        10.000000       4.130000   16791.000000
max     80995.000000   38970.000000   18287.000000

In [15]:
###Identifying NULL values and possible treatments
X.isnull().sum()*100/len(X)

Description     0.268311
Quantity        0.000000
InvoiceDate     0.000000
UnitPrice       0.000000
CustomerID     24.926694
Country         0.000000
dtype: float64

In [19]:
X['CustomerID'].nunique()

4372

In [25]:
###Checking for NA customer
X[X['CustomerID'].isnull()].head()

,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
622,NaN,56,12/1/2010 11:52,0.00,NaN,United Kingdom
1443,DECORATIVE ROSE BATHROOM BOTTLE,1,12/1/2010 14:32,2.51,NaN,United Kingdom
1444,DECORATIVE CATS BATHROOM BOTTLE,2,12/1/2010 14:32,2.51,NaN,United Kingdom
1445,POLKADOT RAIN HAT,4,12/1/2010 14:32,0.85,NaN,United Kingdom
1446,RAIN PONCHO RETROSPOT,2,12/1/2010 14:32,1.66,NaN,United Kingdom

In [20]:
###We only have 0.26% NULL ratios as described so we can safely drop them
###There are 4372 unique customers in the data

## Exploratory Data Analysis

In [22]:
####Understanding the top 10 products purchased 
most_preferred_products = X['Description'].value_counts()[:10]
print(most_preferred_products)

Description
WHITE HANGING HEART T-LIGHT HOLDER    2369
REGENCY CAKESTAND 3 TIER              2200
JUMBO BAG RED RETROSPOT               2159
PARTY BUNTING                         1727
LUNCH BAG RED RETROSPOT               1638
ASSORTED COLOUR BIRD ORNAMENT         1501
SET OF 3 CAKE TINS PANTRY DESIGN      1473
PACK OF 72 RETROSPOT CAKE CASES       1385
LUNCH BAG  BLACK SKULL.               1350
NATURAL SLATE HEART CHALKBOARD        1280
Name: count, dtype: int64

### EDA will continue further

## Data preparation for modelling

In [26]:
X.head()

,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
2,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom
3,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
4,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom

In [27]:
X.dtypes

Description     object
Quantity         int64
InvoiceDate     object
UnitPrice      float64
CustomerID     float64
Country         object
dtype: object

In [28]:
####Filtering for negative Unit Price and Negative Quantity
print(X.shape)
X = X[(X["UnitPrice"] > 0) & (X["Quantity"]>0)]
print(X.shape)

(541909, 6)
(530104, 6)

In [29]:
####Filtering for data where customerID is not null since we are planning to aggregate on customerID
X = X[~X["CustomerID"].isnull()]

In [30]:
print(X.shape)

(397884, 6)

In [33]:
X["InvoiceDate"] = pd.to_datetime(X["InvoiceDate"])

/var/folders/n6/6f6n14n92ggcsn2rfy1dpvz40000gn/T/ipykernel_86206/271279399.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  X["InvoiceDate"] = pd.to_datetime(X["InvoiceDate"])

In [37]:
latest_date = X["InvoiceDate"].max()

In [38]:
X["latest_date"] = latest_date
X["age"] = (X["latest_date"] -  X["InvoiceDate"]).dt.days
X["total_price"] = X["Quantity"] * X["UnitPrice"]

/var/folders/n6/6f6n14n92ggcsn2rfy1dpvz40000gn/T/ipykernel_86206/373889986.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  X["latest_date"] = latest_date
/var/folders/n6/6f6n14n92ggcsn2rfy1dpvz40000gn/T/ipykernel_86206/373889986.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  X["age"] = (X["latest_date"] -  X["InvoiceDate"]).dt.days

In [45]:
####Information at a customer level
customer_X  = X.groupby('CustomerID').agg(total_transaction = ('CustomerID','count'),
                                          total_sum = ('total_price','sum'),
                                          mean_amount = ('total_price', 'mean'),
                                          total_quantiy = ('Quantity', 'sum'),
                                          mean_quantity = ('Quantity','mean'),
                                          n_items = ('Description', 'nunique'),
                                          lifetime = ('age', 'max'),
                                          n_country = ('Country','nunique'),
                                         ).reset_index()

In [46]:
###We can use the below data for modelling purpose.
customer_X.head()

,CustomerID,total_transaction,total_sum,mean_amount,total_quantiy,mean_quantity,n_items,lifetime,n_country
0,12346.0,1,77183.60,77183.600000,74215,74215.000000,1,325,1
1,12347.0,182,4310.00,23.681319,2458,13.505495,103,366,1
2,12348.0,31,1797.24,57.975484,2341,75.516129,22,357,1
3,12349.0,73,1757.55,24.076027,631,8.643836,73,18,1
4,12350.0,17,334.40,19.670588,197,11.588235,17,309,1